In [ ]:
Jupyter Notebook
Command mode
- 셀 자체에 명령
- a(bove) : 현재 셀 위에 추가
- b(elow) : 현재 셀 아래에 추가
- x

In [4]:
3 / 4
3 + 4

7

# 모델 훈련
# Command / Edit mode change shortcut : ESC / ENTER
## 소제목

# 데이터(=2차원 테이블) 분석

In [17]:
import numpy as np
import pandas as pd
import torch

In [18]:
# A, B, C, D, E
math = [89, 92, 91, 90, 91]
math_series = pd.Series(math, index=['A','B','C','D','E'])

In [19]:
# 데이터 접근하기
math_series.iloc[0], math_series['A']

(89, 89)

In [20]:
math_series[-2:]

D    90
E    91
dtype: int64

In [22]:
import matplotlib.pyplot as plt

In [23]:
!dir

 D 드라이브의 볼륨: DATA
 볼륨 일련 번호: 5CF4-6590

 D:\Codes\python\ml_hdat 디렉터리

2025-04-21  오전 09:56    <DIR>          .
2025-04-21  오전 09:56    <DIR>          ..
2025-04-21  오전 09:23    <DIR>          .ipynb_checkpoints
2025-04-21  오전 09:56             3,385 init.ipynb
               1개 파일               3,385 바이트
               3개 디렉터리  1,344,612,909,056 바이트 남음

In [24]:
math_series.sort_values(ascending=False)

B    92
C    91
E    91
D    90
A    89
dtype: int64

In [25]:
math_series[math_series > 90]

B    92
C    91
E    91
dtype: int64

In [26]:
math_series > 90

A    False
B     True
C     True
D    False
E     True
dtype: bool

In [30]:
ret = math_series > 90
print(type(math_series))
print(type(ret))
ret

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

A    False
B     True
C     True
D    False
E     True
dtype: bool

In [33]:
ret = math_series + 2
print(type(ret))
ret

<class 'pandas.core.series.Series'>

A    91
B    94
C    93
D    92
E    93
dtype: int64

In [43]:
eng_series = pd.Series([94,92,87,78,85], index=['A','B','C','D','E'])

In [44]:
ret = math_series / eng_series
ret

A    0.946809
B    1.000000
C    1.045977
D    1.153846
E    1.070588
dtype: float64

print(ret.sum())

In [46]:
eng = [94,92,87,78,85]
kor = [90,89,78,95,88]
index = ['A','B','C','D','E']

In [55]:
# df = pd.DataFrame({"math": math, "kor": kor, "eng": eng}, index=index)
df = pd.DataFrame({"math": math, "kor": kor, "eng": eng, "index": index})
df = df.set_index(keys="index")

In [56]:
df

       math  kor  eng
index
A        89   90   94
B        92   89   92
C        91   78   87
D        90   95   78
E        91   88   85

In [59]:
df[["math", "eng"]]

       math  eng
index
A        89   94
B        92   92
C        91   87
D        90   78
E        91   85

In [60]:
df.loc["A"]

math    89
kor     90
eng     94
Name: A, dtype: int64

In [61]:
df["math"]["A"]

89

In [62]:
df.loc["A", "math"]

89

In [65]:
df.iloc[0,2]

94

In [67]:
# 슬라이싱 --> 기본적으로 행방향으로 짤라옴
df[:2]

       math  kor  eng
index
A        89   90   94
B        92   89   92

In [70]:
# 양방향 슬라이싱
df.iloc[:, 1:]

       kor  eng
index
A       90   94
B       89   92
C       78   87
D       95   78
E       88   85

In [71]:
df.iloc[:2, :2]

       math  kor
index
A        89   90
B        92   89

In [74]:
!jupyter --version

Selected Jupyter core packages...
IPython          : 8.34.0
ipykernel        : 6.29.5
ipywidgets       : 8.1.5
jupyter_client   : 8.6.3
jupyter_core     : 5.7.2
jupyter_server   : 2.15.0
jupyterlab       : 4.3.6
nbclient         : 0.10.2
nbconvert        : 7.16.6
nbformat         : 5.10.4
notebook         : 7.3.3
qtconsole        : not installed
traitlets        : 5.14.3

In [75]:
df.sort_values(by="math", ascending=False)

       math  kor  eng
index
B        92   89   92
C        91   78   87
E        91   88   85
D        90   95   78
A        89   90   94

In [76]:
df.sort_values(by=["math", "eng"], ascending=False)

       math  kor  eng
index
B        92   89   92
C        91   78   87
E        91   88   85
D        90   95   78
A        89   90   94

In [77]:
# 필터링 : 어떤 속성을 기준으로 조건을 주는 것인지 명확히!
df[df["math"] > 90]

       math  kor  eng
index
B        92   89   92
C        91   78   87
E        91   88   85

In [86]:
# 조건이 2개일 때 논리 연산 : and(&), or(|), not(~)
# ()를 이용해서 순서를 정확히 입력!
df[(df["math"] > 90) & (df["eng"] > 90)]

       math  kor  eng
index
B        92   89   92

In [87]:
df + df

       math  kor  eng
index
A       178  180  188
B       184  178  184
C       182  156  174
D       180  190  156
E       182  176  170

In [91]:
# 하나의 데이터프레임에서 가져왔으므로 인덱스나 데이터 순서 고민 필요 없음
df["total"] = df["math"] + df["eng"] + df["kor"]
df["total"]

index
A    273
B    273
C    256
D    263
E    264
Name: total, dtype: int64

In [95]:
df["avg"] = df["total"] / 3
df["avg"].round(2)

index
A    91.00
B    91.00
C    85.33
D    87.67
E    88.00
Name: avg, dtype: float64

# 데이터프레임의 주요기능 5가지
- 시리즈의 연산, 필터링, apply, groupbu, pivot

In [96]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [98]:
df = sns.load_dataset("titanic")

In [99]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True